import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/lab.png',
  description: [
    {
      title: 'Подготовка к сдаче крови.',
      text: 'Забор крови производится из вены и пальца. Перед сдачей крови на анализ необходимо воздержаться от курения в течение часа, за день до исследования не употреблять алкоголь, жирную и жареную пищу, постараться исключить физические и эмоциональные перегрузки. Кровь рекомендуется сдавать в период с 7:00 до 12:00 натощак (через 7-12 часов после последнего приема пищи, допускается только прием воды), для исследования Липидного статуса - строго натощак (после 12-14 часов голода).',
    },
    {
      title: '',
      text: 'Женщинам рекомендуется сдавать кровь на анализ Прогестерона за 7 дней до начала менструального цикла, на анализ Тестостерона, Эстрадиола, Пролактина, Лютеинизирующего гормона, Фолликулостимулирующего гормона (ФСГ) и 17-ОН-прогестерона на 3-7 день цикла. Мужчинам рекомендуется сдавать кровь на анализ ПСА спустя 7 дней после массажа простаты или иных воздействий на простату.',
    },
    {
      title: 'Подготовка к сдаче мочи.',
      text: 'Накануне сдачи мочи на анализ не рекомендуется употреблять овощи и фрукты, которые могут изменить цвет мочи (свекла, морковь и пр.), и принимать мочегонные средства. Женщинам не рекомендуется сдавать мочу во время менструации. Перед сбором мочи нужно произвести тщательный гигиенический туалет половых органов. Для анализа собирают первую утреннюю мочу в стерильный контейнер. При сборе небольшое количество мочи (первые 1-2 секунды) выпустить в унитаз, затем, не прерывая мочеиспускания, собрать мочу в контейнер. Контейнер с собранной мочой следует доставить на исследование в течение 1,5 часов, при невозможности своевременной доставки емкость можно хранить несколько часов при +2...+8°С.',
    },
    {
      title: 'Подготовка к сдаче кала.',
      text: 'Не рекомендуется сдавать кал для исследования после приема препаратов, влияющих на пищеварение, после применения клизмы или введения свечей. Женщинам не рекомендуется сдавать кал во время менструации. Кал собирается в стерильный контейнер после самостоятельного опорожнения кишечника, при этом не допускать примеси мочи к калу. Для бакпосева на дисбактериоз кал собирается в отдельный контейнер. Контейнеры для сбора кала можно приобрести в аптеке или получить заранее при посещении наших медицинских центров.',
    },
    {
      title: 'Подготовка к сдаче грудного молока.',
      text: 'Рекомендуется сдавать молоко до начала антибактериальной терапии или через две недели после ее окончания. Сбор молока проводится самостоятельно, молоко из правой и левой молочных желез сцеживается в объеме по 5-10 мл в отдельные контейнеры, при этом первая порция 5-10 мл сбрасывается. Перед сцеживанием необходимо провести гигиеническую обработку рук и молочных желез. Контейнер с собранным грудным молоком следует доставить на исследование в день сбора, до этого времени контейнер с материалом хранить при температуре +2...+8°С. Стерильные контейнеры для сбора грудного молока можно приобрести в аптеке или получить заранее при посещении наших медицинских центров.',
    },
    {
      title: 'Подготовка к сдаче слюны.',
      text: 'За сутки до взятия пробы следует исключить употребление спиртных напитков. В течение одного часа до сбора слюны не рекомендуется есть, курить, чистить зубы (исключить любые действия, вызывающие кровоточивость десен). За 10 минут до сбора слюны ополоснуть рот водой.',
    },
    {
      title: 'Подготовка к сдаче мазка/соскоба.',
      text: 'Для мужчин и женщин перед сдачей урологического или гинекологического мазка/соскоба рекомендуется в течение 3-х часов не проводить гигиенический туалет половых органов и не мочиться, а также в течение суток воздержаться от половых контактов. Для женщин рекомендуется сдавать гинекологический мазкок/соскоб начиная с 5 дня цикла и не позднее, чем за 5 дней до окончания цикла; в течение суток перед данной процедурой не применять вагинальные свечи, мази, кремы и не проводить спринцевания. В течение суток перед сдачей мазка из глаз рекомендуется не мыть глаза с мылом и не пользоваться косметикой для век и ресниц.',
    },
    {
      title: 'Подготовка к исследованию тканей (гистология эндометрия полости матки [пайпельбиопсия]).',
      text: 'Исследование проводится на 25-26 день менструального цикла; при отсутствии цикла - в любой день. Перед проведением исследования рекомендуется сделать УЗИ матки и придатков, микроскопию гинекологического мазка на флору, цитологию гинекологического соскоба [окрашивание по Романовскому].',
    },
    {
      title: 'Подготовка к исследованию кожи и ее производных (ногти, ресницы, волосы).',
      text: 'В течение суток перед забором ресницы на анализ рекомендуется не мыть глаза с мылом и не пользоваться косметикой для век и ресниц.',
    },
    {
      title: 'Забор мазка на энтеробиоз.',
      text: 'Используется специальный контейнер со шпателем. Приложить шпатель липкой стороной к перианальным складкам и прижать, затем шпатель поместить в контейнер и плотно закрыть крышкой.',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Противопоказаний и рисков не выявлено.',
    },
    {
      title: 'Результаты.',
      text: 'Результат исследования состоит из заключения, которое выдается в печатном виде, по e-mail и размещается на сайте в личном кабинете. Срок готовности результатов - один день (до 9:00 следующего дня, а для мазков/соскобов - до 14:00 следующего дня), за исключением некоторых анализов, срок готовности которых указан в строке прайса.',
    },
    {
      title: '',
      text: 'Анализы производятся количественным методом, анализы с отметкой «качественно» производятся качественным методом.',
    },
    {
      title: 'Исследования проводятся БЕЗ предварительной записи.',
      text: '',
    },
  ]
}

export const metadata: Metadata = {
  title: 'Лабораторные исследования - МедЭксперт',
  description: 'Лабораторные исследования - МедЭксперт',
}

export default function LaboratoryResearchPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
