import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/dop_serv.png',
  description: [
    {
      title: 'Справки.',
      text: 'Справка в бассейн выдается врачом-терапевтом и врачом-педиатром, при этом необходимо иметь заключение врача-дерматолога и результаты мазка на энтеробиоз (действительны в течение 3 месяцев).'
    },
    {
      title: '',
      text: 'Справка о беременности выдается врачом-акушером-гинекологом на основании ультразвукового исследования (УЗИ), анализа крови на ХГЧ и осмотра пациентки. Справка о допуске к занятиям спортом выдается врачом-терапевтом или врачом-педиатром, при этом необходимо иметь электрокардиограмму (ЭКГ) покоя (действительна в течение 10 дней).'
    },
    {
      title: '',
      text: 'Справка для поступления в учебное заведение (форма 086/у) выдается врачом-терапевтом и врачом-педиатром, при этом необходимо при себе иметь данные о выполненных прививках, результаты медицинского осмотра врачей-специалистов (хирург, невролог, оториноларинголог, офтальмолог), результаты флюорографии (действительны в течение 1 года), результаты общего анализа крови, общего анализа мочи и результаты электрокардиографии (ЭКГ) покоя (действительны в течение 10 дней). Справка для поступления в учебное заведение (форма 086/у) выдается абитуриентам, поступающим в учебные заведения; лицам до 18 лет, поступающим на работу.',
    },
    {
      title: '',
      text: 'Санаторно-курортная карта для взрослых (форма 072/у) выдается врачом-терапевтом, при этом необходимо иметь заключение врача-гинеколога (для женщин), результаты флюорографии в одной проекции (действительны в течение 1 года), результаты общего анализа крови, определения скорости оседания эритроцитов (СОЭ), общего анализа мочи с микроскопией и электрокардиограмму (ЭКГ) покоя (действительны в течение 10 дней).',
    },
    {
      title: '',
      text: 'Санаторно-курортная карта для детей (форма 076/у) выдается врачом-педиатром, при этом необходимо иметь результаты общего анализа крови, определения скорости оседания эритроцитов (СОЭ), общего анализа мочи с микроскопией и результат мазка на энтеробиоз (действительны в течение 10 дней). Медицинская карта ребенка (форма 026/у-2000) выдается врачом-педиатром после комплексного обследования ребенка при его поступлении в детский сад или школу. Поступающим в детский сад необходимо иметь результаты общего анализа крови, определения скорости оседания эритроцитов (СОЭ), общего анализа мочи с микроскопией, исследования кала на яйца гельминтов, мазка на энтеробиоз (анализы действительны в течение 10 дней), осмотра врачей-специалистов (педиатр, невролог, хирург, травматолог-ортопед, офтальмолог, уролог (мальчики), акушер-гинеколог (девочки), оториноларинголог), сведения о выполненных прививках. Поступающим в школу необходимо предоставить результаты общего анализа крови, определения скорости оседания эритроцитов (СОЭ), общего анализа мочи с микроскопией, исследования кала на яйца гельминтов, мазка на энтеробиоз (анализы действительны в течение 10 дней), УЗИ щитовидной железы, УЗИ печени, УЗИ желчного пузыря, УЗИ поджелудочной железы, УЗИ селезенки, УЗИ сердца, УЗИ почек и надпочечников, электрокардиографии (ЭКГ) покоя, осмотра врачей-специалистов (педиатр, невролог, хирург, травматолог-ортопед, офтальмолог, уролог (мальчики), акушер-гинеколог (девочки), оториноларинголог, психиатр), сведения о выполненных прививках.',
    },
    {
      title: '',
      text: 'Выписка из медицинской карты (форма 027/у) выдается врачом-специалистом по запросу пациента.'
    }
  ]
}

export const metadata: Metadata = {
  title: 'Дополнительные услуги - МедЭксперт',
  description: 'Дополнительные услуги - МедЭксперт',
}

export default function AdditionalServicesPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
