import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/uzi.png',
  description: [
    {
      title: 'Ультразвуковое исследование (УЗИ)',
      text: '- метод диагностики, основанный на принципе отражения ультразвуковых волн, позволяющий получить изображения внутренних органов и тканей организма. Пациент ложится на кушетку, врач наносит специальный гель на кожу и с помощью ультразвукового датчика проводит исследование. Длительность исследования - от 5 до 20 минут. Исследование головного мозга (нейросонография) проводится только для детей до одного года.',
    },
    {
      title: 'Подготовка.',
      text: 'Специальной подготовки не требуется. Исследование органов брюшной полости, почечного кровотока проводится через 7 часов после приема пищи. Определение функции желчного пузыря проводится через 12 часов после приема пищи, при этом необходимо взять с собой 200 грамм сметаны, а также рекомендуется дополнительно пройти исследование печени и желчного пузыря. Для женщин рекомендуется проводить исследования молочных желез и органов органов малого таза на 5-12 день цикла. Необходимо выпить 1 литр негазированной воды за 1 час до начала исследований: матки и придатков (для детей и лиц, не живущих половой жизнью), мочевого пузыря и предстательной железы. За 12 часов до начала ТРУЗИ необходимо полностью опорожнить кишечник. Рекомендуется сделать ЭКГ перед проведением исследования сердца.',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Противопоказаний и рисков не выявлено.',
    },
    {
      title: 'Результаты.',
      text: 'Результат исследования состоит из заключения, снимков и видео, которые размещаются на сайте в личном кабинете. Заключение выдается в печатном виде и по e-mail. Срок готовности результатов - в течение 5 минут.',
    },
    {
      title: 'Исследования проводятся по предварительной записи. Рекомендуется взять с собой медицинские выписки, заключения, снимки и направления.',
      text: '',
    },
  ]
}

export const metadata: Metadata = {
  title: 'Ультразвуковые исследования(УЗИ) - МедЭксперт',
  description: 'Ультразвуковые исследования(УЗИ) - МедЭксперт',
}

export default function UltrasoundPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
