import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/mrt.png',
  description: [
    {
      title: 'Магнитно-резонансная томография (МРТ)',
      text: '– метод диагностики, основанный на принципе магнитного резонанса, позволяющий получить изображения внутренних органов и тканей организма без облучения рентгеновскими лучами. Пациент ложится на специальный стол, который помещают внутрь большой трубы (туннель магнита), при этом область ног и пространство за головой будет открыто. Во время исследования необходимо сохранять неподвижность. Длительность исследования МРТ - от 10 до 40 минут. Для улучшения качества изображений иногда внутривенно вводят контрастные вещества. Исследования гипофиза и молочных желез проводятся только с контрастированием. МРТ Скрининг всего тела - методика, цель которой - первичная диагностика органов и тканей человеческого организма на предмет выявления опухолей и других серьезных патологических изменений, но не дает детального представления о каждом органе.',
    },
    {
      title: 'Подготовка.',
      text: 'Исследование брюшной полости проводится утром натощак или в течение дня через 6 часов после приема пищи. За 1 час до исследования органов малого таза следует помочиться и принять две таблетки «Но-шпа». Женщинам рекомендуется воздержаться от прохождения исследования органов малого таза в период менструации, кроме экстренных случаев (длительные кровянистые выделения, онкологические заболевания). Исследование молочных желез рекомендуется проходить на 5–12 день цикла и не менее чем через месяц после окончания приема гормональных препаратов. Мужчинам перед исследованием органов малого таза рекомендуется сделать анализ крови на ПСА общий. Перед проведением исследования сердца следует сделать ЭКГ и УЗИ сердца, а также получить консультацию врача- кардиолога.',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Вес более 130 кг. Кардиостимулятор и несъемные электронные устройства в организме. Металлические предметы в голове, шее, груди и животе. Гемостатические клипсы в голове. Беременность при контрастировании. Требуется направление врача при исследовании сердца, при беременности до 12 недель и при наличии установленных клапанов, шунтов, стентов, фильтров и клипс. Не рекомендуется при клаустрофобии. Дополнительных противопоказаний и рисков не выявлено. Противопоказания, а также потенциальные риски могут быть выявлены медицинским работником, исходя из индивидуальных особенностей каждого пациента.',
    },
    {
      title: 'Результаты.',
      text: 'Результат исследования состоит из заключения и снимков, которые размещаются на сайте в личном кабинете. Заключение выдается в печатном виде и по e-mail. Снимки выдаются на диске и на пленке. Для исследований, проведенных с 8:00 до 22:00, срок готовности результатов - в течение часа. Для исследований, проведенных с 22:00 до 8:00, срок готовности результатов - до 12:00 следующего дня.',
    },
    {
      title: 'Исследования проводятся по предварительной записи. Рекомендуется взять с собой медицинские выписки, заключения, снимки и направления.',
      text: ''
    }
  ]
}

export const metadata: Metadata = {
  title: 'Магнитно-резонансная томография (МРТ) - МедЭксперт',
  description: 'Магнитно-резонансная томография (МРТ) - МедЭксперт',
}

export default function MagneticResonanceImagingPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
