import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/km.png',
  description: [
    {
      title: 'Консультации и осмотры.',
      text: 'Первичная консультация врача-специалиста включает в себя осмотр, рекомендации и направления. Повторная консультация проводится, как правило, без осмотра, даются рекомендации и делаются назначения.'
    },
    {
      title: 'Манипуляции и исследования.',
      text: 'При консультациях врачей-специалистов могут проводиться различные манипуляции и исследования. Кольпоскопия - исследование врачом-гинекологом шейки матки с помощью кольпоскопа и тестов с применением растворов уксусной кислоты и Люголя. Гониоскопия - осмотр передней камеры глаза при помощи специальной линзы. Пахиметрия - измерение толщины роговицы глаза. Рефрактокератометрия - бесконтактный метод определения нарушений рефракции глаза. Тонометрия ручным методом Маклакова - измерение внутриглазного давления контактным ручным методом с помощью специальных грузов. Тонометрия автоматическим методом - измерение внутриглазного давления индукционным (контактным мгновенным измерением) и пневматическим (струей воздуха) методами. Периметрия - определение полей зрения. А-сканирование - одномерное ультразвуковое исследование глаза. В-сканирование - двумерное ультразвуковое исследование глаза. Отоскопия – инструментальное обследование ушей. Риноскопия - инструментальное обследование носа. Фарингоскопия – инструментальное обследование зева и глотки. Ларингоскопия - инструментальное обследование гортани. Аудиометрия – проверка слуха при помощи аудиометра. Тимпанометрия (импедансометрия) - исследование функции среднего уха, состояния слуховой трубы и подвижности барабанной перепонки при помощи тимпанометра. Синускопия – ультразвуковое исследование (УЗИ) околоносовых пазух при помощи синускопа. Большинство манипуляций врачом-оториноларингологом проводится с использованием специализированного лор-комбайна (промывание миндалин, носоглотки и ушей, распыление лекарственных средств и др.). Урофлоуметрия - исследование выделительной функции мочевого пузыря. Дерматоскопия – исследование кожи с помощью цифрового дерматоскопа с многократным увеличением. Ударно-волновая терапия (УВТ) – аппаратный способ лечения патологий и травм опорно-двигательного аппарата. Проводится врачом-травматологом-ортопедом.',
    },
    {
      title: 'Подготовка.',
      text: 'Осмотр врача-гинеколога рекомендуется проводить в первой половине цикла после окончания менструации, при этом в течение суток воздержаться от половых контактов, не применять вагинальные свечи, мази, кремы и не проводить спринцевания. В день осмотра врачом-офтальмологом рекомендуется не пользоваться контактными линзами и косметикой для век и ресниц, воздержаться от управления автомобилем. Перед консультацией врача-кардиолога рекомендуется сделать электрокардиограмму (ЭКГ) покоя. Перед проведением инъекционной PRP-терапии необходимо иметь при себе анализы крови (Общий анализ крови, СОЭ, АЧТВ, протромбин, тромбиновое время, фибриноген) (действительны в течение 10 дней).',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Для консультаций и осмотров врачей-специалистов противопоказаний не выявлено. Для кольпоскопии противопоказанием является непереносимость уксусной кислоты и препаратов йода, а также кольпоскопия не рекомендуется ранее 6-8 недель после родов или лечения шейки матки хирургическими методами. Дополнительных противопоказаний и рисков не выявлено. Противопоказания к врачебным манипуляциям и услугам, а также потенциальные риски врачебных манипуляций определяет врач-специалист.',
    },
    {
      title: 'Результаты.',
      text: 'Результат консультации или исследования состоит из заключения, снимков и видео, которые размещаются на сайте в личном кабинете. Заключение выдается в печатном виде и по e-mail. Срок готовности результатов - в течение 5 минут.',
    },
    {
      title: 'Исследования проводятся по предварительной записи. Рекомендуется взять с собой медицинские выписки, заключения, снимки и направления.',
      text: ''
    }
  ]
}

export const metadata: Metadata = {
  title: 'Консультации и манипуляции - МедЭксперт',
  description: 'Консультации и манипуляции - МедЭксперт',
}

export default function ConsultationPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
