import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/rentgen.png',
  description: [
    {
      title: 'Рентгенография (Рентген)',
      text: '- метод лучевой диагностики, позволяющий получить изображения любой части тела. Пациент становится у стойки аппарата или располагается на специальном столе. Длительность исследования - несколько секунд. Оборудование низкодозное (0,02-0,04 мЗв) и безопасно для здоровья пациентов, в том числе для детей. Флюорография проводится методом цифровой рентгенографии с высоким разрешением, при этом лучевая нагрузка ниже в десять раз, чем при обычной флюорографии.',
    },
    {
      title: '',
      text: 'Для улучшения качества изображений внутривенно вводят контрастные вещества.',
    },
    {
      title: 'Подготовка.',
      text: 'Специальной подготовки не требуется. Исследование органов брюшной полости проводится через 7 часов после приема пищи.',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Беременность.\n' +
        'Дополнительных противопоказаний и рисков не выявлено. Противопоказания, а также потенциальные риски могут быть выявлены медицинским работником, исходя из индивидуальных особенностей каждого пациента.',
    },
    {
      title: 'Результаты.',
      text: 'Результат исследования состоит из заключения и снимков, которые размещаются на сайте в личном кабинете. Заключение по рентгену выдается в печатном виде и по e-mail. Снимки выдаются на пленке. Срок готовности результатов - в течение часа. Для флюорографии срок готовности результатов - в течение 20 минут.',
    },
    {
      title: 'Исследования проводятся по предварительной записи. Рекомендуется взять с собой медицинские выписки, заключения, снимки и направления.',
      text: ''
    }
  ]
}

export const metadata: Metadata = {
  title: 'Рентгенография (Рентген) - МедЭксперт',
  description: 'Рентгенография (Рентген) - МедЭксперт',
}

export default function XRayPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
