import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/fd.png',
  description: [
    {
      title: 'Функциональная диагностика (ФД).',
      text: 'Электрокардиограмма (ЭКГ) покоя записывается для пациентов любого возраста, начиная с 6 месяцев, с помощью электрокардиографа в течение нескольких минут.'
    },
    {
      title: '',
      text: 'Электрокардиограмма по Холтеру и мониторинг артериального давления записываются для пациентов старше 15 лет в течение суток (или двух суток) с помощью миниатюрных приборов, которые фиксируют на теле пациента. Приборы не создают неудобств. Нельзя принимать ванну. Следует использовать только хлопковое белье. В ходе исследования нужно совершить не менее трех подъемов по лестнице в привычном темпе, если нет противопоказаний. В течение исследования необходимо вести электронный дневник прибора, отмечая все предусмотренные в нем события (физическая нагрузка, ходьба, секс, сон, прием пищи, прием лекарств, болевые ощущения, стресс). Во время сна приборы можно положить рядом с собой. После окончания времени записи необходимо совершить повторный визит для снятия приборов.'
    },
    {
      title: '',
      text: 'Спирометрия (исследование функции внешнего дыхания) - это измерение жизненной емкости легких и скоростных показателей дыхания, которое проводится на спирометре в течение примерно 15 минут.',
    },
    {
      title: '',
      text: 'Кардиотокография (КТГ) плода - это регистрация и анализ частоты сердцебиения плода в покое, движении, при сокращениях матки и воздействии различных факторов среды. КТГ записывается для беременных, начиная с 33-й недели беременности, с помощью фетального монитора в течение примерно 20 минут.',
    },
    {
      title: '',
      text: 'Электроэнцефалография (ЭЭГ) - исследование электрической активности головного мозга, которое проводится для пациентов старше 7 лет с помощью электроэнцефалографа в течение примерно 25 минут. При диагностике на голову пациента надевается специальная тканевая шапочка с присоединенными к ней электродами, после исследования необходимо будет очистить голову от следов электродного геля.',
    },
    {
      title: '',
      text: 'Электронейромиография (ЭНМГ) - исследование функционального состояния периферической нервной системы и мышц, которое проводится с помощью электронейромиографа в течение примерно 60 минут.'
    },
    {
      title: 'Подготовка.',
      text: 'Специальной подготовки не требуется. Перед проведением электрокардиографии по Холтеру или мониторинга артериального давления рекомендуется сделать электрокардиограмму покоя и надеть хлопковое белье на период всего исследования (не следует надевать синтетическое или шерстяное). Мужчинам перед проведением электрокардиографии по Холтеру необходимо сбрить волосяной покров в области груди.'
    },
    {
      title: '',
      text: 'Электроэнцефалография (ЭЭГ) проводится при чистых, сухих и распущенных волосах, без украшений и заколок, в течение суток перед исследованием не принимать успокоительные препараты. В течение трех часов перед электронейромиографией (ЭНМГ) не рекомендуется курить и употреблять продукты, содержащие кофеин (кофе, чай, шоколад).'
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Противопоказаний и рисков не выявлено.'
    },
    {
      title: 'Результаты.',
      text: 'Результат исследования состоит из заключения, которое выдается в печатном виде, по e-mail и размещается на сайте в личном кабинете. Срок готовности результатов - в течение 30 минут.'
    },
    {
      title: 'Рекомендуется взять с собой медицинские выписки, заключения, снимки и направления и обменную карту беременной (для КТГ), паспорт на установленный кардиостимулятор (для ЭКГ по Холтеру).',
      text: ''
    }
  ]
}

export const metadata: Metadata = {
  title: 'Функциональная диагностика - МедЭксперт',
  description: 'Функциональная диагностика - МедЭксперт',
}

export default function FunctionalDiagnosticPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
