import s from './page.module.scss'
import {Container} from "@/shared/ui/Container/Container"
import Image from "next/image"

const services = [
  {
    id: 1,
    name: 'Магнитно-резонансная\nтомография (МРТ)',
    icon: '/servicesIcons/mrt.png',
  },
  {
    id: 2,
    name: 'Компьютерная\nтомография (КТ)',
    icon: '/servicesIcons/kt.png',
  },
  {
    id: 3,
    name: 'Рентгенография\n(Рентген)',
    icon: '/servicesIcons/xray.png',
  },
  {
    id: 4,
    name: 'Ультразвуковые\nисследования (УЗИ)',
    icon: '/servicesIcons/uzi.png',
  },
  {
    id: 5,
    name: 'Функциональная\nдиагностика (ФД)',
    icon: '/servicesIcons/fd.png',
  },
  {
    id: 6,
    name: 'Консультации и\nманипуляции',
    icon: '/servicesIcons/consultations.png',
  },
  {
    id: 7,
    name: 'Косметология',
    icon: '/servicesIcons/cosmetology.png',
  },
  {
    id: 8,
    name: 'Реабилитация',
    icon: '/servicesIcons/rehabilitation.png',
  },
  {
    id: 9,
    name: 'Услуги\nдополнительные',
    icon: '/servicesIcons/additionalServices.png',
  },
  {
    id: 10,
    name: 'Лабораторная\nдиагностика',
    icon: '/servicesIcons/laboratory.png',
  }
]

const service = {
  imgPath: '/aboutServices/img.png',
  description: [
    {
      title: 'Консультации и осмотры.',
      text: 'Первичная консультация врача-косметолога включает в себя осмотр, рекомендации и назначения. Повторная консультация врача-косметолога проводится, как правило, без осмотра, оценивается эффективность проведенного лечения, проводится корректировка назначений, даются рекомендации.',
    },
    {
      title: 'Манипуляции и услуги.',
      text: 'Для проведения некоторых косметологических манипуляций врач-косметолог применяет анестезию (аппликационную или инъекционную). Перед проведением косметологических процедур проводится удаление макияжа (демакияж). Аппаратная косметология - комплекс современных технологий, которые помогают эффективно и безопасно решать многие эстетические проблемы. В основе аппаратной косметологии лежит воздействие лазерным излучением, ультразвуком, микротоками и световыми волнами. Радиочастотный (RF) микроигольчатый лифтинг кожи - инвазивная процедура омоложения, которая запускает процесс обновления кожи за счет воздействия радиочастотных импульсов, нагревающих глубокие слои кожи. Радиочастотный (RF) неинвазивный лифтинг кожи - неинвазивная процедура омоложения, которая запускает процесс обновления кожи за счет воздействия радиочастотных импульсов, нагревающих поверхностные слои кожи. Термолифтинг кожи - радиочастотное нетравматическое омолаживающее воздействие на поверхностные и глубокие слои кожи. Фотоомоложение кожи (метод IPL) - технология, основанная на использовании светового потока высокой интенсивности, применяется для решения возрастных проблем кожи, удаления пигментаций, сосудистых патологий. Микротоковое восстановление кожи, ультразвуковое восстановление кожи, электростимуляция кожи, электропорация кожи - процедуры, направленные на поддержание тонуса кожи. Инъекционное восстановление кожи - это метод восстановления тонуса кожи, улучшения контуров и упругости кожи с помощью введения лекарственных препаратов. Косметическое восстановление кожи - уходовые процедуры с применением профессиональных косметических средств. Вакуумный гидропилинг кожи - инновационный, эффективный метод, который одновременно очищает, питает и увлажняет кожу. Ультразвуковой, механический, электрический пилинг кожи - аппаратные методы очищения кожи. Химический пилинг - метод очищения кожи с помощью профессиональных косметических средств. Контурная пластика (метод филлеромоделирования, липомоделирования) - инъекционные методы выравнивания контуров лица. Лазерная эпиляция (диодный лазер) - безболезненный и эффективный метод избавления от нежелательных волос при помощи инфракрасного излучения (диодный лазер).',
    },
    {
      title: 'Подготовка.',
      text: 'Специальной подготовки не требуется.',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Для консультации и осмотра врача-косметолога противопоказаний не выявлено. Противопоказания к косметологическим манипуляциям и услугам, а также потенциальные риски косметологических манипуляций определяет врач-косметолог.',
    },
    {
      title: 'Прием врача-косметолога, косметологические манипуляции и услуги проводятся по предварительной записи.',
      text: '',
    },
  ]
}

export default function AboutServicesPage() {
  return (
    <Container className={s.container}>
      <div className={s.priceGroups}>
        <div className={s.header}>
          <button>
            <Image src={'/buttons/burger.svg'} alt={'Меню'} width={35} height={25}/>
          </button>
          <div>
            Виды услуг
          </div>
        </div>
        <div className={s.priceGroupItems}>
          {services.map((service) => (
            <div key={service.id} className={s.serviceItem}>
              <Image src={service.icon} alt={service.name} width={35} height={35}/>
              <span className={s.serviceName}>{service.name}</span>
            </div>
          ))}
        </div>
        {/*<button className={s.atlasButton}>*/}
        {/*  <Image src={'/atlasVertLogo.svg'} alt={'Атлас пациента'} width={50} height={60}/>*/}
        {/*  <span>Записаться онлайн</span>*/}
        {/*</button>*/}
      </div>
      <div className={s.serviceWrapper}>
        <Image src={service.imgPath} alt={'Обложка'} width={1000} height={479}/>
        <div className={s.serviceDescription}>
          {service.description.map((el, index)=>(
            <p key={index}><strong>{el.title}</strong> {el.text}</p>
          ))}
        </div>
      </div>
    </Container>
  )
}