import {Metadata} from "next"
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription"

const service = {
  imgPath: '/aboutServices/cosmetology.png',
  description: [
    {
      title: 'Консультации и осмотры.',
      text: 'Первичная консультация врача-косметолога включает в себя осмотр, рекомендации и назначения. Повторная консультация врача-косметолога проводится, как правило, без осмотра, оценивается эффективность проведенного лечения, проводится корректировка назначений, даются рекомендации.',
    },
    {
      title: 'Манипуляции и услуги.',
      text: 'Для проведения некоторых косметологических манипуляций врач-косметолог применяет анестезию (аппликационную или инъекционную). Перед проведением косметологических процедур проводится удаление макияжа (демакияж). Аппаратная косметология - комплекс современных технологий, которые помогают эффективно и безопасно решать многие эстетические проблемы. В основе аппаратной косметологии лежит воздействие лазерным излучением, ультразвуком, микротоками и световыми волнами. Радиочастотный (RF) микроигольчатый лифтинг кожи - инвазивная процедура омоложения, которая запускает процесс обновления кожи за счет воздействия радиочастотных импульсов, нагревающих глубокие слои кожи. Радиочастотный (RF) неинвазивный лифтинг кожи - неинвазивная процедура омоложения, которая запускает процесс обновления кожи за счет воздействия радиочастотных импульсов, нагревающих поверхностные слои кожи. Термолифтинг кожи - радиочастотное нетравматическое омолаживающее воздействие на поверхностные и глубокие слои кожи. Фотоомоложение кожи (метод IPL) - технология, основанная на использовании светового потока высокой интенсивности, применяется для решения возрастных проблем кожи, удаления пигментаций, сосудистых патологий. Микротоковое восстановление кожи, ультразвуковое восстановление кожи, электростимуляция кожи, электропорация кожи - процедуры, направленные на поддержание тонуса кожи. Инъекционное восстановление кожи - это метод восстановления тонуса кожи, улучшения контуров и упругости кожи с помощью введения лекарственных препаратов. Косметическое восстановление кожи - уходовые процедуры с применением профессиональных косметических средств. Вакуумный гидропилинг кожи - инновационный, эффективный метод, который одновременно очищает, питает и увлажняет кожу. Ультразвуковой, механический, электрический пилинг кожи - аппаратные методы очищения кожи. Химический пилинг - метод очищения кожи с помощью профессиональных косметических средств. Контурная пластика (метод филлеромоделирования, липомоделирования) - инъекционные методы выравнивания контуров лица. Лазерная эпиляция (диодный лазер) - безболезненный и эффективный метод избавления от нежелательных волос при помощи инфракрасного излучения (диодный лазер).',
    },
    {
      title: 'Подготовка.',
      text: 'Специальной подготовки не требуется.',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Для консультации и осмотра врача-косметолога противопоказаний не выявлено. Противопоказания к косметологическим манипуляциям и услугам, а также потенциальные риски косметологических манипуляций определяет врач-косметолог.',
    },
    {
      title: 'Прием врача-косметолога, косметологические манипуляции и услуги проводятся по предварительной записи.',
      text: '',
    },
  ]
}

export const metadata: Metadata = {
  title: 'Косметология - МедЭксперт',
  description: 'Косметология - МедЭксперт',
}

export default function CosmetologyPage() {
  return (
      <ServiceDescription service={service} />
  )
}
