import {Metadata} from "next";
import {ServiceDescription} from "@/widgets/ServiceDescription/ServiceDescription";

const service = {
  imgPath: '/aboutServices/kt.png',
  description: [
    {
      title: 'Компьютерная томография (КТ)',
      text: '- метод лучевой рентгеновской диагностики, позволяющий получить послойные изображения любой области организма. Пациент ложится на специальный стол, совмещенный со сканером в виде большого кольца. Длительность исследования - несколько минут.',
    },
    {
      title: 'Подготовка к КТ.',
      text: 'Специальной подготовки не требуется. Исследование органов брюшной полости проводится через 7 часов после приема пищи. За 30 минут до исследования мочевого пузыря, матки и придатков или предстательной железы необходимо выпить 500 мл негазированной воды.',
    },
    {
      title: 'Противопоказания и риски.',
      text: 'Вес более 130 кг. Беременность. Некоторые заболевания и аллергия на препараты с йодом при контрастировании. Не рекомендуется детям до 12 лет.\n' +
        'Дополнительных противопоказаний и рисков не выявлено. Противопоказания, а также потенциальные риски могут быть выявлены медицинским работником, исходя из индивидуальных особенностей каждого пациента.',
    },
    {
      title: 'Результаты.',
      text: 'Результат исследования состоит из заключения и снимков, которые размещаются на сайте в личном кабинете. Заключение выдается в печатном виде и по e-mail. Снимки выдаются на диске и на пленке. Для исследований, проведенных с 8:00 до 22:00, срок готовности результатов - в течение часа, а для флюорографии срок готовности результатов - в течение 20 минут. Для исследований, проведенных с 22:00 до 8:00, срок готовности результатов - до 12:00 следующего дня.',
    },
    {
      title: 'Исследования проводятся по предварительной записи. Рекомендуется взять с собой медицинские выписки, заключения, снимки и направления.',
      text: ''
    }
  ]
}

export const metadata: Metadata = {
  title: 'Компьютерная томография (КТ) - МедЭксперт',
  description: 'Компьютерная томография (КТ) - МедЭксперт',
}

export default function ComputerTomographyPage() {
  return (
    <ServiceDescription service={service}/>
  )
}
